--本番環境用--------------------------
--INSERT IGNORE INTO parkinglot(id,address1,address2,address3,name,capacity,hourlyRate,updateDate) 
--VALUES (1,'東京都','品川区西五反田','1丁目','タイムズパーク24グループ本社ビル',50,1320,'2025-07-20');
 
 
--ローカルテスト用--------------------------
INSERT INTO parkinglot(address1,address2,address3,name,capacity,hourlyRate,updateDate)
VALUES ('東京都','品川区西五反田','1丁目','タイムズパーク24グループ本社ビル',50,1320,'2025-07-20'),
('東京都', '新宿区新宿', '1丁目', 'タイムズ新宿御苑前第３', 2, 1320, '2025-07-03'),
('東京都', '新宿区歌舞伎町', '1丁目', 'タイムズ新宿東宝ビル', 158, 990, '2025-07-10'),
('東京都', '新宿区歌舞伎町', '1丁目', 'タイムズ新宿歌舞伎町', 28, 500, '2025-07-06'),
('東京都', '中野区中野', '4丁目', 'タイムズ中野区役所', 53, 1000, '2025-07-11'),
('東京都', '板橋区大山東町', '34', 'タイムズ大山東町', 5, 660, '2025-07-20'),
('埼玉県', '越谷市越ヶ谷', '4丁目', 'タイムズ越谷市役所南側第１駐車場', 49, 200, '2025-07-17'),
('埼玉県', '草加市草加', '3丁目', 'タイムズ草加３丁目', 25, 200, '2025-07-04'),
('埼玉県', 'さいたま市大宮区大門町', '3丁目', 'タイムズ大宮大門町第６', 10, 1320, '2025-07-24'),
('埼玉県', 'さいたま市大宮区仲町', '3丁目', 'タイムズ大宮仲町第３', 11, 1320, '2025-07-12'),
('埼玉県', '川越市三久保町', '16', '川越郵便局駐車場', 12, 400, '2025-07-14'),
('栃木県', '栃木市平柳町', '1丁目', 'タイムズ新栃木駅前', 52, 100, '2025-07-21'),
('栃木県', '那須塩原市大原間西', '1丁目', 'タイムズ那須塩原駅前第２', 21, 110, '2025-07-05'),
('栃木県', '宇都宮市大通り', '4丁目', 'タイムズ宇都宮大通り４丁目', 15, 300, '2025-07-23'),
('栃木県', '宇都宮市駅前通り', '1丁目', 'タイムズ宇都宮駅前通り第５', 8, 330, '2025-07-22'),
('群馬県', '太田市飯田町', '1256', 'タイムズ太田市役所前', 45, 200, '2025-07-07'),
('群馬県', '桐生市永楽町', '6', 'タイムズＭＥＧＡドン・キホーテ桐生店', 32, 200, '2025-07-09'),
('神奈川県', '藤沢市片瀬海岸', '2丁目', 'タイムズ片瀬江の島駅前第２', 6, 660, '2025-07-15'),
('神奈川県', '藤沢市片瀬海岸', '1丁目', 'タイムズ江の島二楽', 11, 660, '2025-07-16'),
('神奈川県', '横浜市港北区篠原町', '3014', 'タイムズ新横浜南口第２', 37, 330, '2025-07-25'),
('神奈川県', '川崎市幸区大宮町', '10', 'タイムズ川崎大宮町第３', 11, 1100, '2025-07-19'),
('千葉県', '千葉市稲毛区轟町', '2丁目', 'タイムズ稲毛轟町', 13, 440, '2025-07-01'),
('千葉県', '千葉県成田市取香', '500', 'ホテル日航成田第２', 70, 330, '2025-07-02'),
('千葉県', '千葉県印旛郡酒々井町中央台', '1丁目', 'タイムズ酒々井駅前', 22, 440, '2025-07-06'),
('茨城県', 'つくば市天久保', '1丁目', 'タイムズつくば天久保', 20, 220, '2025-07-03'),
('茨城県', '水戸市中央', '2丁目', 'タイムズ水戸市役所西', 23, 220, '2025-07-04'),
('茨城県', '土浦市桜町', '1丁目', 'タイムズ土浦桜町第５', 8, 220, '2025-07-05'),
('北海道', '札幌市北区北２４条西', '5丁目', 'タイムズ札幌サンプラザ', 195, 400, '2025-07-08'),
('北海道', '札幌市中央区北４条西', '6丁目', 'タイムズステーション札幌駅前', 305, 600, '2025-07-10'),
('北海道', '札幌市北区北９条西', '4丁目', 'タイムズ北海道信用金庫北口ビル', 34, 800, '2025-07-11'),
('北海道', '函館市若松町', '12', 'タイムズ函館駅西', 139, 400, '2025-07-12'),
('北海道', '小樽市花園', '1丁目', 'タイムズ小樽花園１丁目第２', 16, 200, '2025-07-13'),
('秋田県', '秋田市千秋久保田町', '3丁目', 'タイムズ秋田駅前第２', 29, 200, '2025-07-14'),
('秋田県', '能代市柳町', '1', 'タイムズ秋田銀行能代支店', 45, 200, '2025-07-15'),
('山形県', '上山市矢来', '2丁目', 'タイムズかみのやま温泉駅西口', 108, 110, '2025-07-16'),
('山形県', '山形市双葉町', '1丁目', 'タイムズ山形駅ビル駐車場', 567, 300, '2025-07-17'),
('山形県', '山形市香澄町', '3丁目', 'タイムズ山形駅前', 15, 400, '2025-07-18'),
('福島県', '福島市三河南町', '8', 'タイムズ福島駅西口', 23, 200, '2025-07-19');

INSERT INTO rates(parkinglotId,rangeId,amount,time,maxRateTimely,maxRate24h,maxRateDaily) 
VALUES (1, 1, 330, 15, null, 3000, null),
(2,2,330,15,null,null,null),
(2,3,330,60,null,null,null),
;

INSERT INTO range(startTime,endTime,monday,tuesday,wednesday,thursday,friday,saturday,sunday,holiday) 
VALUES (0000, 2400, true, true, true, true, true, true, true, true),
(0700, 0000, true, true, true, true, true, true, true, true),
(0000, 0700, true, true, true, true, true, true, true, true),
;